app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.all
---
SELECT "contacts".* FROM "contacts" ORDER BY "contacts"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def create
    @contact = Contact.new(contact_params)
    @history = History.new(first_name: @contact.first_name, last_name: @contact.last_name, email: @contact.email, phone: @contact.phone, action: 'Creation')

    respond_to do |format|
      if @contact.save
        @history.save
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."email" = $1 LIMIT $2  [["email", "monicaperez97sb@gmail.com"], ["LIMIT", 1]]
SELECT "histories".* FROM "histories" ORDER BY "histories"."created_at" DESC
INSERT INTO "histories" ("first_name", "last_name", "action", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "1"], ["last_name", "1"], ["action", "creation"], ["created_at", "2021-11-08 12:13:35.591582"], ["updated_at", "2021-11-08 12:13:35.591582"]]
INSERT INTO "contacts" ("first_name", "last_name", "email", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "contacts" ("first_name", "last_name", "email", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "2"], ["last_name", "2"], ["email", "2"], ["phone", "2"], ["created_at", "2021-11-08 12:40:47.933634"], ["updated_at", "2021-11-08 12:40:47.933634"]]

  def update
    @history = History.new(first_name: @contact.first_name, last_name: @contact.last_name, email: @contact.email, phone: @contact.phone, action: 'Update')

    respond_to do |format|
      if @contact.update(contact_params)
        @history.save
---
SELECT "histories".* FROM "histories" ORDER BY "histories"."created_at" DESC
INSERT INTO "contacts" ("first_name", "last_name", "email", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "histories" ("first_name", "last_name", "email", "phone", "action", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @history = History.new(first_name: @contact.first_name, last_name: @contact.last_name, email: @contact.email, phone: @contact.phone, action: 'Removal')

    @contact.destroy
    respond_to do |format|
      @history.save
---
SELECT "histories".* FROM "histories" ORDER BY "histories"."created_at" DESC
DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 5]]
INSERT INTO "contacts" ("first_name", "last_name", "email", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "histories" ("first_name", "last_name", "email", "phone", "action", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def history
    @registrations = History.order(created_at: :desc).all
---
SELECT "histories".* FROM "histories" ORDER BY registrations.created_at DESC