app/controllers/contacts_controller.rb

UPDATE "contacts" SET "first_name" = $1, "last_name" = $2, "email" = $3, "updated_at" = $4 WHERE "contacts"."id" = $5  [["first_name", "Saray"], ["last_name", "Acedo Delgado"], ["email", "acedosaray@gmail.com"], ["updated_at", "2021-11-06 14:16:31.270998"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @contact.update(contact_params)