app/models/contact.rb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."email" = $1 LIMIT $2  [["email", "monicaperez97sb@gmail.com"], ["LIMIT", 1]]
---
    def uniqueness_of_email
        existing_record = Contact.find_by_email(email)